let threads
let defaultThread = [
  {
    id: 0,
    title: "Looking for a dive buddy in southern taiwan",
    author: "luke1999",
    date: 1676190912609,
    isFollow:0,
    isDelete:0,
    content:
      "I've had a lot of leisure time lately. Need to plan a dive trip but don’t have a buddy anymore. Anyone interested? connect with me, we can plan something!",
    comments: [
      {
        author: "megraz",
        date: 1676191351966,
        content:
          "ME!!! I have never been to southern taiwan and I literally just started researching it today!!!",
      },
      {
        author: "luke1999",
        date: 1676191529199,
        content: "Sure find me on IG @UsernameABCDE12345",
      },
    ],
  },
  {
    id: 1,
    title: "求蘭嶼有經驗自潛導潛，目前內建A2潛水員2位、成團空位可加人",
    author: "文章牛肉王",
    date: 1676191755385,
    isFollow:1,
    isDelete:0,
    content: "預計6月中到蘭嶼，開團目前內建2人，熟海況有經驗的導潛歡迎聯絡。",
    comments: [
      {
        author: "台南虱目魚湯",
        date: 1676267609781,
        content:
          "蘭嶼導潛可以找我，在這邊3年了，建議可以再揪2位直接開團，IG @UsernameABCDE12345 再加我聯繫",
      },
      {
        author: "文章牛肉王",
        date: 1676268018890,
        content: "OKOK, 目前還差2位，歡迎A2以上一起來～",
      },
      {
        author: "dolphin0618",
        date: 1676268098890,
        content:
          "求加入這邊A2+1，預計6/17~6/25在蘭嶼！ 台南虱目魚湯是哪間潛店的導潛嗎？",
      },
      {
        author: "台南虱目魚湯",
        date: 1676268098890,
        content: "dolphin0618 我之前在海鰻，現在在堡礁，所以對蘭嶼海況很暸解哦",
      },
    ],
  },
  {
    id: 2,
    title: "綠島自潛1人失蹤意外，潛伴制度絕不可被忽視！",
    author: "aquaman3000",
    date: 1676191755385,
    isFollow:1,
    isDelete:0,
    content: "最近自潛發生幾起令人擔心的事，今天來和大家淺談「潛伴制度」﻿\n\n大海藏著許多不可預測的事，而實施良好的潛伴制度，是非常重要的！﻿\n﻿\n👉🏽獨潛為什麼危險﻿\n自由潛水的水下意外，只有短短幾秒鐘的救援黃金時間，若沒有潛伴即時發現，往往救護人員到場時，已錯過最佳時機﻿\n﻿\n👉🏽如何挑選潛伴﻿\n潛伴的最大深度不是重點，具備幾米的救援能力才是你該關心的﻿\n﻿\n👉🏽如何互相戒護﻿\n水面互相告知每一潛的潛水計畫，並隨時注意周遭；當潛伴從你下潛，到出水比ok手勢為止，每一秒都注視著你，那恭喜，他就是是你的最佳潛伴 ﻿\n﻿\n📢大家不停提倡潛伴制度，就是因為它絕不可被忽視！﻿",
    comments: [
      {
        author: "台南虱目魚湯",
        date: 1676267609781,
        content:
          "保守的潛水，並不是無知。\n放棄下潛而折返，並非懦弱的表現。\n一股腦的衝勁，絕對不是帥氣。",
      },
      {
        author: "文章牛肉王",
        date: 1676268018890,
        content: "潛安！",
      },
      {
        author: "dolphin0618",
        date: 1676268098890,
        content:
          "不要獨潛🙋🏿‍♀️",
      },
      {
        author: "台南虱目魚湯",
        date: 1676268098890,
        content: "獨潛真的太危險了！",
      },
    ],
  },
  {
    id: 3,
    title: "2023/6/22-25 端午連假四天三夜船潛",
    author: "房間裡的大象",
    date: 1676268837118,
    isFollow:0,
    isDelete:0,
    content:
      "徵伴內容：目前還有空房:2人房*2 or 4人房*1\n其他說明：\n關於這次一起出團的夥伴:\n我們是同一個導師計劃的學員，聚餐發現大家都喜歡潛水因此想要揪團端午連假一起去潛水，另外想揪船潛主因是不用走很久岸潛的路，我們訂到端午連假綠島最後一艘船(其他都滿了) 希望同一團的人多一些，可以討論潛點以及訂火車團體票\n目前我們有7位成員確定，1位正在確認行程中\n希望你:\n1.有AOW執照，OW或同等級執照10支氣瓶以上經驗也可以\n2.能夠至少2個或4個人一起配合旅宿房型，只有一人也沒關係歡迎認識我們當新朋友\n行程:\n6/22早上火車，下午搭船到綠島放行李後岸潛1支 教練了解所有人的程度到哪以便\n調整後續潛點行程難度\n6/23早上船潛2支氣瓶，下午自由安排(也可以岸潛)\n6/24早上船潛2支氣瓶，下午自由安排(也可以岸潛)\n6/25早上船潛2支氣瓶，下午準備搭車回台東",
    comments: [
      {
        author: "Chris",
        date: 1676268838118,
        content: "還有位子嗎？ IG @UsernameABCDE12345 ",
      },
      {
        author: "氮醉鮪魚罐頭",
        date: 1676268938118,
        content: "+1 AOW 70支左右 IG @UsernameABCDE12345",
      },
    ],
  },
  {
    id: 4,
    title: "求推薦Atomic調節器維修，北部佳",
    author: "aquaman3000",
    date: 1676273444225,
    isFollow:0,
    isDelete:0,
    content:
      "上次調節器一下水就狂噴氣！浪費了好幾Bar，求台北推薦的店家！",
    comments: [],
  }
];

let user
let defaultUser = 
    {
        username:'aquaman3000',
        lic:{scuba:'PADI-Master Scuba Diver',freediving:'AIDA-Master freediver'}
    }


if(localStorage && localStorage.getItem('threads')){
    threads = JSON.parse(localStorage.getItem('threads'))
} else {
    threads = defaultThread
}

if(localStorage && localStorage.getItem('user')){
    user = JSON.parse(localStorage.getItem('user'))
} else {
    user = defaultUser
}